'''Home work for the lesson 29'''

'''Task 1 - Дослідіть, які є графові бази даних і в яких сферах вони застосовуються 
(або які великі технологічні компанії якими БД користуються).'''




# Графові бази даних використовуються в таких сферах:

# Соціальні мережі: Графові бази даних допомагають створювати картину того, 
# як користувачі пов'язані між собою в соціальних мережах і аналізувати ці взаємозв'язки.
# Рекомендаційні системи: Вони використовуються для того, 
# щоб робити рекомендації користувачам, спираючись на зв'язки між користувачами та об'єктами.

# Біоінформатика: Графові бази даних допомагають вченим вивчати взаємозв'язки між молекулами та генами для медичних та генетичних досліджень.

# Транспорт і логістика: Вони використовуються для оптимізації маршрутів та виявлення зв'язків у транспортній системі.

# Запити до геоданих: Для обробки географічних даних та аналізу графічних мереж, таких як мережі доріг.

# Аналіз бізнес-процесів (BPM): Графові бази даних допомагають моделювати та аналізувати бізнес-процеси та їх взаємозв'язки.

# Розробка ігор: У гральній індустрії графові бази даних можуть використовуватися для моделювання
# внутрішніх структур гри та взаємозв'язків між об'єктами у грі.


# Facebook: Facebook використовує графову базу даних для зберігання 
# та оптимізації обробки величезного обсягу даних про соціальні зв'язки між користувачами.

# LinkedIn: LinkedIn використовує графову базу даних для побудови та аналізу професійних мереж користувачів.

# Twitter: Twitter також використовує графові бази даних для зберігання та обробки даних про соціальні зв'язки та твіти користувачів.

# Airbnb: Airbnb використовує графові бази даних для рекомендацій та пошуку житла на основі географічних та інших взаємозв'язків.

# Walmart: Walmart використовує графову базу даних для аналізу логістичних мереж та оптимізації постачання.

# eBay: eBay використовує графові бази даних для покращення рекомендаційних систем та аналізу зв'язків між продуктами і покупцями.

# Amazon: Amazon використовує графові бази даних для різних застосувань, включаючи рекомендації 
# та аналіз соціальних взаємозв'язків для свого електронного магазину та інших послуг.

# Netflix: Netflix використовує графові бази даних для рекомендацій та відслідковування взаємозв'язків між фільмами та користувачами.

# Google: Google також має деякі проекти, які використовують графові бази даних для аналізу взаємозв'язків, наприклад, для Google Knowledge Graph.

# Uber: Uber використовує графову базу даних для аналізу географічних мереж та оптимізації маршрутів.





'''Task 2 - Імплементуйте зважений направлений граф (directed weighted graph) з пошуком найкоротшого шляху 
між двома заданими вертексами (нодами). Зверніть увагу, що при створенні графу вам потрібно 
буде вказати не тільки ребра (зв’язки між вертексами), а ще й задати вагу на кожне ребро.'''

class Graph:
    def __init__(self, vertices):
        self.vertices = vertices
        self.edges = []
    
    def add_edge(self, u, v, w):
        self.edges.append((u, v, w))
    
    def directed_weighted_graph(self, start):
        distance = {v: float('inf') for v in range(self.vertices)}
        distance[start] = 0

        for _ in range(self.vertices - 1):
            for u, v, w in self.edges:
                if distance[u] + w < distance[v]:
                    distance[v] = distance[u] + w

        for u, v, w in self.edges:
            if distance[u] + w < distance[v]:
                print("The graph contains a negative cycle")
                return 1

        return distance


g = Graph(5)
g.add_edge(0, 1, 1)
g.add_edge(0, 2, 4)
g.add_edge(1, 2, 3)
g.add_edge(1, 3, 2)
g.add_edge(3, 1, 1)
g.add_edge(2, 4, 2)
g.add_edge(3, 4, 5)
g.add_edge(4, 3, 1)

start_vertex = 3
shortest_distances = g.directed_weighted_graph(start_vertex)
for vertex, distance in enumerate(shortest_distances):
    print(f"Distance from node {start_vertex} to node {vertex} = {distance}")
